W5D2/gettit/app/views/subs/show.html.erb


<% if @sub.posts.empty? %>
---
SELECT "posts".* FROM "posts" INNER JOIN "sub_posts" ON "posts"."id" = "sub_posts"."post_id" WHERE "sub_posts"."sub_id" = $1  [["sub_id", 1]]
SELECT  1 AS one FROM "posts" INNER JOIN "sub_posts" ON "posts"."id" = "sub_posts"."post_id" WHERE "sub_posts"."sub_id" = $1 LIMIT $2  [["sub_id", 3], ["LIMIT", 1]]

  <ul>
    <% @sub.posts.each do |post|%>
---
SELECT "posts".* FROM "posts" INNER JOIN "sub_posts" ON "posts"."id" = "sub_posts"."post_id" WHERE "sub_posts"."sub_id" = $1  [["sub_id", 2]]