W4D4/music_app/app/controllers/albums_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @album = Album.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @band = Band.find_by(id: params[:band_id])

INSERT INTO "albums" ("year", "live_album", "band_id", "title") VALUES ($1, $2, $3, $4) RETURNING "id"  [["year", 2002], ["live_album", true], ["band_id", 2], ["title", "Football Head"]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @album = Album.new(album_params)
    if @album.save
      redirect_to album_url(@album)
    else
      @band = Band.find_by(id: @album.band_id)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @album = Album.find_by(id: params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1 WHERE "albums"."id" = $2  [["year", 2003], ["id", 1]]
---
  def update
    @album = Album.find_by(id: params[:id])
    if @album.update(album_params)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 3]]
---
  def destroy
    @album = Album.find_by(id: params[:id])
    if @album
      @album.destroy