W4D4/music_app/app/controllers/bands_controller.rb

  def index
    @bands = Band.all
---
SELECT "bands".* FROM "bands"

  def show
    @band = Band.find_by(id: params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @band = Band.new(band_params)
    if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "cool_band_cool"], ["created_at", "2018-08-16 21:25:44.893145"], ["updated_at", "2018-08-16 21:25:44.893145"]]

  def edit
    @band = Band.find_by(id: params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @band = Band.find_by(id: params[:id])
    if @band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Chad & His Friends"], ["updated_at", "2018-08-16 19:33:18.753573"], ["id", 3]]

  def destroy
    @band = Band.find_by(id: params[:id])
    if @band
      @band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 5]]