W4D4/music_app/app/controllers/tracks_controller.rb

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @track = Track.find_by(id: params[:id])
    if @track
      @album = Album.find_by(id: @track.album_id)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @album = Album.find_by(id: params[:album_id])

INSERT INTO "tracks" ("title", "ord", "lyrics", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "bangers n mash"], ["ord", 1], ["lyrics", "HAHAHAHAHAHAHA"], ["album_id", 3], ["created_at", "2018-08-16 21:06:50.571491"], ["updated_at", "2018-08-16 21:06:50.571491"]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @track = Track.new(track_params)
    if @track.save
      redirect_to track_url(@track)
    else
      @album = Album.find_by(id: @track.album_id)