W5D2/gettit/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "5GtU-zWAq8Y6Pwlv1lUYgg"], ["LIMIT", 1]]
---
  def current_user
    User.find_by_session_token(session[:session_token])