W5D2/gettit/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "wow\r\n"], ["user_id", 10], ["post_id", 6], ["created_at", "2018-08-21 21:19:55.772695"], ["updated_at", "2018-08-21 21:19:55.772695"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    @comment.post_id = params[:post_id]
    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 11]]
---
  def destroy
    @comment = Comment.find(params[:id])
    post_id = @comment.post_id
    if @comment.author != current_user
      flash[:errors] = ["that ain't yo comment!"]
    else
      @comment.destroy