W5D2/gettit/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author = current_user

    if @post.save
---
INSERT INTO "posts" ("title", "user_id", "content", "created_at", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asdfasdf"], ["user_id", 10], ["content", "asdfasdf"], ["created_at", "2018-08-21 20:02:47.837318"], ["updated_at", "2018-08-21 20:02:47.837318"], ["url", "asdfasdf"]]

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 6]]