W5D2/gettit/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Tippy Taps"], ["description", "cute pets dance!"], ["created_at", "2018-08-21 18:56:16.234208"], ["updated_at", "2018-08-21 18:56:16.234208"], ["user_id", 1]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.moderator = current_user
    if @sub.save

SELECT "subs".* FROM "subs"
---
  def index
    @subs = Sub.all

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @sub = Sub.find_by(id: params[:id])