W5D2/gettit/app/views/posts/_form.html.erb

    Check all Subgettits:<br>
    <% Sub.all.each do |s| %>
---
SELECT "subs".* FROM "subs"