W5D2/gettit/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 6]]
---

  <% @post.comments.each do |comment|%>