W4D5/goals_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "easy@easy.com"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    user = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "KA_RhiLpLabDIp9SMDXeEQ"], ["updated_at", "2018-08-17 21:18:44.699027"], ["id", 3]]
---
  def reset_session_token!
    self.session_token = self.class.generate_session_token
    self.save!