W4D4/music_app/app/models/user.rb

  def self.find_by_credentials(name_or_email, password)
    if EMAIL_REGEX.match(name_or_email)
      user = User.find_by(email: name_or_email)
    else
      user = User.find_by(username: name_or_email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "bob@builders.com"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Bob"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = self.class.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "n8cYY_XuTGI3p-ZyuXridA"], ["updated_at", "2018-08-16 19:37:40.569163"], ["id", 1]]