W4D4/music_app/app/views/albums/_form.html.erb

      <option disabled <%= album.band_id ? '' : 'selected' %>>-- Select Band --</option>
      <% Band.all.each do |b| %>
---
SELECT "bands".* FROM "bands"