W4D4/music_app/app/views/albums/show.html.erb

      <h3>Tracks</h3>
      <% unless @album.tracks.empty? %>
      <% @album.tracks.order(:ord).each do |t| %>
---
SELECT  1 AS one FROM "tracks" WHERE "tracks"."album_id" = $1 LIMIT $2  [["album_id", 1], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1 ORDER BY "tracks"."ord" ASC  [["album_id", 1]]