W5D2/gettit/app/models/user.rb

  def self.find_by_credentials(username, pw)
    user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jakejake"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = self.class.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "j7_AVl6dyGvRuEqL1sqGTg"], ["updated_at", "2018-08-21 21:25:42.689579"], ["id", 10]]