W4D4/music_app/app/views/tracks/_form.html.erb

      <option disabled <%= a_id ? '' : 'selected' %>>-- Select Album --</option>
      <% Album.all.each do |a| %>
---
SELECT "albums".* FROM "albums"