W4D4/music_app/app/views/bands/show.html.erb

      <h3>Albums</h3>
      <% unless @band.albums.empty? %>
      <% @band.albums.each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 2]]
SELECT  1 AS one FROM "albums" WHERE "albums"."band_id" = $1 LIMIT $2  [["band_id", 1], ["LIMIT", 1]]